### Terraform Plan Output for `prod-team-account/state/S3`
```hcl
[command]/home/runner/work/_temp/16f757e5-724a-49fd-a7e1-8b235be81196/terraform-bin show -no-color tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_kms_key.s3_key will be destroyed
  # (because aws_kms_key.s3_key is not in configuration)
  - resource "aws_kms_key" "s3_key" {
      - arn                                = "arn:aws:kms:ap-northeast-2:243359234795:key/59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - description                        = "KMS key for S3 encryption" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null
      - is_enabled                         = true -> null
      - key_id                             = "59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::243359234795:root"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowRootAccountFullAccess"
                    },
                  - {
                      - Action    = [
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:DescribeKey",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "243359234795"
                              - "aws:SourceArn"     = "arn:aws:s3:::cloudfence-prod-state"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "s3.amazonaws.com"
                        }
                      - Resource  = "*"
                      - Sid       = "AllowS3ServicePrincipal"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                             = "ap-northeast-2" -> null
      - rotation_period_in_days            = 365 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
    }

  # aws_s3_bucket_server_side_encryption_configuration.encryption will be updated in-place
  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {
        id     = "cloudfence-prod-state"
        # (2 unchanged attributes hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:ap-northeast-2:243359234795:key/59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_kms.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for S3 encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::243359234795:root"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowRootAccountFullAccess"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "243359234795"
                              + "aws:SourceArn"     = "arn:aws:s3:::cloudfence-prod-state"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowS3ServicePrincipal"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_kms_key.s3_key will be destroyed%0A  # (because aws_kms_key.s3_key is not in configuration)%0A  - resource "aws_kms_key" "s3_key" {%0A      - arn                                = "arn:aws:kms:ap-northeast-2:243359234795:key/59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null%0A      - bypass_policy_lockout_safety_check = false -> null%0A      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null%0A      - description                        = "KMS key for S3 encryption" -> null%0A      - enable_key_rotation                = true -> null%0A      - id                                 = "59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null%0A      - is_enabled                         = true -> null%0A      - key_id                             = "59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null%0A      - key_usage                          = "ENCRYPT_DECRYPT" -> null%0A      - multi_region                       = false -> null%0A      - policy                             = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "kms:*"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::243359234795:root"%0A                        }%0A                      - Resource  = "*"%0A                      - Sid       = "AllowRootAccountFullAccess"%0A                    },%0A                  - {%0A                      - Action    = [%0A                          - "kms:Encrypt",%0A                          - "kms:Decrypt",%0A                          - "kms:ReEncrypt*",%0A                          - "kms:GenerateDataKey*",%0A                          - "kms:DescribeKey",%0A                        ]%0A                      - Condition = {%0A                          - StringEquals = {%0A                              - "aws:SourceAccount" = "243359234795"%0A                              - "aws:SourceArn"     = "arn:aws:s3:::cloudfence-prod-state"%0A                            }%0A                        }%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "s3.amazonaws.com"%0A                        }%0A                      - Resource  = "*"%0A                      - Sid       = "AllowS3ServicePrincipal"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - region                             = "ap-northeast-2" -> null%0A      - rotation_period_in_days            = 365 -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {} -> null%0A    }%0A%0A  # aws_s3_bucket_server_side_encryption_configuration.encryption will be updated in-place%0A  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {%0A        id     = "cloudfence-prod-state"%0A        # (2 unchanged attributes hidden)%0A%0A      - rule {%0A          - bucket_key_enabled = false -> null%0A%0A          - apply_server_side_encryption_by_default {%0A              - kms_master_key_id = "arn:aws:kms:ap-northeast-2:243359234795:key/59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null%0A              - sse_algorithm     = "aws:kms" -> null%0A            }%0A        }%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # module.s3_kms.aws_kms_key.this will be created%0A  + resource "aws_kms_key" "this" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + description                        = "KMS key for S3 encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "kms:*"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::243359234795:root"%0A                        }%0A                      + Resource  = "*"%0A                      + Sid       = "AllowRootAccountFullAccess"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "kms:Encrypt",%0A                          + "kms:Decrypt",%0A                          + "kms:ReEncrypt*",%0A                          + "kms:GenerateDataKey*",%0A                          + "kms:DescribeKey",%0A                        ]%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "aws:SourceAccount" = "243359234795"%0A                              + "aws:SourceArn"     = "arn:aws:s3:::cloudfence-prod-state"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "s3.amazonaws.com"%0A                        }%0A                      + Resource  = "*"%0A                      + Sid       = "AllowS3ServicePrincipal"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region                             = "ap-northeast-2"%0A      + rotation_period_in_days            = (known after apply)%0A      + tags_all                           = (known after apply)%0A    }%0A%0APlan: 1 to add, 1 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_kms_key.s3_key will be destroyed%0A  # (because aws_kms_key.s3_key is not in configuration)%0A  - resource "aws_kms_key" "s3_key" {%0A      - arn                                = "arn:aws:kms:ap-northeast-2:243359234795:key/59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null%0A      - bypass_policy_lockout_safety_check = false -> null%0A      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null%0A      - description                        = "KMS key for S3 encryption" -> null%0A      - enable_key_rotation                = true -> null%0A      - id                                 = "59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null%0A      - is_enabled                         = true -> null%0A      - key_id                             = "59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null%0A      - key_usage                          = "ENCRYPT_DECRYPT" -> null%0A      - multi_region                       = false -> null%0A      - policy                             = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "kms:*"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::243359234795:root"%0A                        }%0A                      - Resource  = "*"%0A                      - Sid       = "AllowRootAccountFullAccess"%0A                    },%0A                  - {%0A                      - Action    = [%0A                          - "kms:Encrypt",%0A                          - "kms:Decrypt",%0A                          - "kms:ReEncrypt*",%0A                          - "kms:GenerateDataKey*",%0A                          - "kms:DescribeKey",%0A                        ]%0A                      - Condition = {%0A                          - StringEquals = {%0A                              - "aws:SourceAccount" = "243359234795"%0A                              - "aws:SourceArn"     = "arn:aws:s3:::cloudfence-prod-state"%0A                            }%0A                        }%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "s3.amazonaws.com"%0A                        }%0A                      - Resource  = "*"%0A                      - Sid       = "AllowS3ServicePrincipal"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - region                             = "ap-northeast-2" -> null%0A      - rotation_period_in_days            = 365 -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {} -> null%0A    }%0A%0A  # aws_s3_bucket_server_side_encryption_configuration.encryption will be updated in-place%0A  ~ resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {%0A        id     = "cloudfence-prod-state"%0A        # (2 unchanged attributes hidden)%0A%0A      - rule {%0A          - bucket_key_enabled = false -> null%0A%0A          - apply_server_side_encryption_by_default {%0A              - kms_master_key_id = "arn:aws:kms:ap-northeast-2:243359234795:key/59bd9d62-c3a3-4ee1-8a07-3ff29240bda6" -> null%0A              - sse_algorithm     = "aws:kms" -> null%0A            }%0A        }%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # module.s3_kms.aws_kms_key.this will be created%0A  + resource "aws_kms_key" "this" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + description                        = "KMS key for S3 encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "kms:*"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::243359234795:root"%0A                        }%0A                      + Resource  = "*"%0A                      + Sid       = "AllowRootAccountFullAccess"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "kms:Encrypt",%0A                          + "kms:Decrypt",%0A                          + "kms:ReEncrypt*",%0A                          + "kms:GenerateDataKey*",%0A                          + "kms:DescribeKey",%0A                        ]%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "aws:SourceAccount" = "243359234795"%0A                              + "aws:SourceArn"     = "arn:aws:s3:::cloudfence-prod-state"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "s3.amazonaws.com"%0A                        }%0A                      + Resource  = "*"%0A                      + Sid       = "AllowS3ServicePrincipal"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region                             = "ap-northeast-2"%0A      + rotation_period_in_days            = (known after apply)%0A      + tags_all                           = (known after apply)%0A    }%0A%0APlan: 1 to add, 1 to change, 1 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```